Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоговыйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Уровни</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Лоты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лоты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Заявка/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура КоличествоЛотовПриИзменении(Элемент)
	
	Количество 		= Объект.КоличествоЛотов * ПолучитьКоличествоАкцийВЛоте(Объект.Инструмент, Объект.Дата);
	Объект.Сумма 	=  Количество * Объект.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Количество 		= Объект.КоличествоЛотов * ПолучитьКоличествоАкцийВЛоте(Объект.Инструмент, Объект.Дата);
	Объект.Сумма 	=  Количество * Объект.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	КоличествоАкцийВЛоте 	= ПолучитьКоличествоАкцийВЛоте(Объект.Инструмент, Объект.Дата);
	Объект.КоличествоЛотов 	=  Цел(Объект.Сумма / Объект.Цена /КоличествоАкцийВЛоте);
	Объект.Сумма 			=  Объект.КоличествоЛотов * КоличествоАкцийВЛоте * Объект.Цена;
	
КонецПроцедуры

//&НаКлиенте
// Процедура ДатаСоздание(Элемент, СтандартнаяОбработка)
//	 СтандартнаяОбработка = Ложь;
//	 Объект.Дата = ТекущаяДата() - ПолучитьОткланениеОтВремениБиржи();
//	 
// КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

&НаСервереБезКонтекста
  Функция ПолучитьКоличествоАкцийВЛоте(Акция, ПериодОтбора)
	
	Возврат  РегистрыСведений.Лоты.ПолучитьАктуальноеКоличествоАкцийВЛоте(Акция, ПериодОтбора);
     
 КонецФункции // ПолучитьКоличествоАкцийВЛоте()

&НаСервереБезКонтекста
Функция  ПолучитьОткланениеОтВремениБиржи()

    ОткланениеОтВремениБиржи = Константы.ОткланениеОтВремениБиржи * 60;
	
КонецФункции



#КонецОбласти
